README.org
*** HAVING
  It filters the result of group by like where. In the following
  example, the result is filtered to those countries with customers
  having a special email patter: 
  #+begin_src sql
    select country, count(city) from customers group by country having  email like '%com';	
  #+end_src
  We can use multiple columns for group by. If there are more columns
  in the group by, these groups need to be in the select part
  too. NULL is categorized separately.

  WHERE is used before grouping and HAVING is used after it. 
* WEEK #3
** Using Subqueries
They are used to create queries inside queries.
#+begin_src sql
	      select country, company from customers
	      where customerid in
	      (select customerid from invoices where billingstate like 'a%');
#+end_src
** Subquery Best Practices and Considerations
Format your code using [[https://poorsql.com/][poorsql.com]]
** Joins
*** selecting from different tables
#+begin_src sql
SELECT orders.order_id, customers.customer_name
FROM orders
INNER JOIN customers ON orders.customer_id = customers.customer_id;

#+end_src
The dot (.) in orders.order_id and customers.customer_name is used to
specify the table from which each column should be retrieved. This
notation is often referred to as "table.column" notation, and it's
necessary when you are selecting columns from multiple tables that
have columns with the same name.
*** INNER join
#+begin_src sql
SELECT orders.order_id, customers.customer_name
FROM orders
INNER JOIN customers ON orders.customer_id = customers.customer_id;

#+end_src

1. `SELECT orders.order_id, customers.customer_name`: This part of the SQL statement specifies the columns you want to retrieve in the result set. It's saying that you want to retrieve two columns:
   - `orders.order_id`: This is the `order_id` column from the `orders` table.
   - `customers.customer_name`: This is the `customer_name` column from the `customers` table.

2. `FROM orders`: This part of the statement specifies the source table from which you want to retrieve data. In this case, it's the `orders` table.

3. `INNER JOIN customers ON orders.customer_id = customers.customer_id`: This is where the actual join operation occurs. Let's break it down further:
   - `INNER JOIN`: This specifies that you want to perform an inner join between the `orders` table and the `customers` table. An inner join returns only the rows where there is a match in both tables.
   - `customers` is the name of the table you're joining with.
   - `ON orders.customer_id = customers.customer_id`: This part of the statement specifies the join condition. It tells the database how to match rows between the two tables. Specifically, it's saying that you want to join rows where the `customer_id` column in the `orders` table is equal to the `customer_id` column in the `customers` table. This condition establishes the relationship between the two tables based on the `customer_id` column.

So, when you execute this SQL statement, SQLite will retrieve data from both the `orders` and `customers` tables and combine it into a single result set. The result will include pairs of `order_id` and `customer_name` where the `customer_id` values in the `orders` and `customers` tables match.

For example, if you have the following data:

*orders table:*
| order_id | customer_id |
|----------+-------------|
|        1 |         101 |
|        2 |         102 |
|        3 |         103 |

*customers table:*
| customer_id | customer_name |
|-------------+---------------|
|         101 | Alice         |
|         102 | Bob           |
|         104 | Carol         |

The result of the SQL query will be:

| order_id | customer_name |
|----------+---------------|
|        1 | Alice         |
|        2 | Bob           |

As you can see, only the rows with matching `customer_id` values (1
and 2) are included in the result, and it combines the relevant data
from both tables.
*** LEFT JOIN (or LEFT OUTER JOIN)
- A LEFT JOIN returns all rows from the left table and the matched rows
from the right table.
- If there's no match in the right table, NULL
values are filled in for the columns from the right table.

Example:
#+begin_src sql
SELECT customers.customer_name, orders.order_id
FROM customers
LEFT JOIN orders ON customers.customer_id = orders.customer_id;
  
#+end_src
*** RIGHT JOIN (or RIGHT OUTER JOIN)
- A RIGHT JOIN is similar to a LEFT JOIN, but it returns all rows
from the right table and the matched rows from the left table.
- If there's no match in the left table, NULL values are filled in for
the columns from the left table.

Example:
#+begin_src sql
SELECT customers.customer_name, orders.order_id
FROM customers
RIGHT JOIN orders ON customers.customer_id = orders.customer_id;

#+end_src
*** LEFT or RIGHT
In SQL joins, particularly when discussing LEFT JOIN and RIGHT JOIN,
the terms "left" and "right" refer to the order of the tables being
joined and the direction of the inclusion of rows in the result
set. These terms help describe which table's data is preserved fully
and which table's data may have missing values (NULLs) in the result
set. Let's clarify the differences:

1. LEFT JOIN (or LEFT OUTER JOIN):
   - The "left" table is the table listed on the left side of the JOIN
     clause.
   - All rows from the left table are included in the result set,
     regardless of whether there is a match in the right table.
   - If there is a match in the right table, the corresponding data is
     included in the result set.
   - If there is no match in the right table, NULL values are used for
     the columns from the right table.

2. RIGHT JOIN (or RIGHT OUTER JOIN):
   - The "right" table is the table listed on the right side of the
     JOIN clause.
   - All rows from the right table are included in the result set,
     regardless of whether there is a match in the left table.
   - If there is a match in the left table, the corresponding data is
     included in the result set.
   - If there is no match in the left table, NULL values are used for
     the columns from the left table.

In summary, the primary difference between LEFT JOIN and RIGHT JOIN is
the direction in which they include rows from the tables involved in
the join. LEFT JOIN keeps all rows from the left table, while RIGHT
JOIN keeps all rows from the right table. The choice of whether to use
LEFT JOIN or RIGHT JOIN depends on your specific data and query
requirements. Most often, LEFT JOIN is used because it retains all
records from the "left" or main table and includes matching data from
the "right" or related table when available.
