README.md


### HAVING

It filters the result of group by like where. In the following
example, the result is filtered to those countries with customers
having a special email patter: 

    select country, count(city) from customers group by country having  email like '%com';	

We can use multiple columns for group by. If there are more columns
in the group by, these groups need to be in the select part
too. NULL is categorized separately.

WHERE is used before grouping and HAVING is used after it. 


<a id="org3b25922"></a>

# WEEK #3


<a id="org32da0c5"></a>

## Using Subqueries

They are used to create queries inside queries.

    select country, company from customers
    where customerid in
    (select customerid from invoices where billingstate like 'a%');


<a id="org0f8a994"></a>

## Subquery Best Practices and Considerations

Format your code using [poorsql.com](https://poorsql.com/)


<a id="orga2a0e84"></a>

## Joins


### selecting from different tables

    SELECT orders.order_id, customers.customer_name
    FROM orders
    INNER JOIN customers ON orders.customer_id = customers.customer_id;

The dot (.) in orders.order<sub>id</sub> and customers.customer<sub>name</sub> is used to
specify the table from which each column should be retrieved. This
notation is often referred to as "table.column" notation, and it's
necessary when you are selecting columns from multiple tables that
have columns with the same name.


### INNER join

    SELECT orders.order_id, customers.customer_name
    FROM orders
    INNER JOIN customers ON orders.customer_id = customers.customer_id;

1.  \`SELECT orders.order<sub>id</sub>, customers.customer<sub>name</sub>\`: This part of the SQL statement specifies the columns you want to retrieve in the result set. It's saying that you want to retrieve two columns:
    -   \`orders.order<sub>id</sub>\`: This is the \`order<sub>id</sub>\` column from the \`orders\` table.
    -   \`customers.customer<sub>name</sub>\`: This is the \`customer<sub>name</sub>\` column from the \`customers\` table.

2.  \`FROM orders\`: This part of the statement specifies the source table from which you want to retrieve data. In this case, it's the \`orders\` table.

3.  \`INNER JOIN customers ON orders.customer<sub>id</sub> = customers.customer<sub>id</sub>\`: This is where the actual join operation occurs. Let's break it down further:
    -   \`INNER JOIN\`: This specifies that you want to perform an inner join between the \`orders\` table and the \`customers\` table. An inner join returns only the rows where there is a match in both tables.
    -   \`customers\` is the name of the table you're joining with.
    -   \`ON orders.customer<sub>id</sub> = customers.customer<sub>id</sub>\`: This part of the statement specifies the join condition. It tells the database how to match rows between the two tables. Specifically, it's saying that you want to join rows where the \`customer<sub>id</sub>\` column in the \`orders\` table is equal to the \`customer<sub>id</sub>\` column in the \`customers\` table. This condition establishes the relationship between the two tables based on the \`customer<sub>id</sub>\` column.

So, when you execute this SQL statement, SQLite will retrieve data from both the \`orders\` and \`customers\` tables and combine it into a single result set. The result will include pairs of \`order<sub>id</sub>\` and \`customer<sub>name</sub>\` where the \`customer<sub>id</sub>\` values in the \`orders\` and \`customers\` tables match.

For example, if you have the following data:

**orders table:**

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">order<sub>id</sub></th>
<th scope="col" class="org-right">customer<sub>id</sub></th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">101</td>
</tr>


<tr>
<td class="org-right">2</td>
<td class="org-right">102</td>
</tr>


<tr>
<td class="org-right">3</td>
<td class="org-right">103</td>
</tr>
</tbody>
</table>

**customers table:**

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">customer<sub>id</sub></th>
<th scope="col" class="org-left">customer<sub>name</sub></th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">101</td>
<td class="org-left">Alice</td>
</tr>


<tr>
<td class="org-right">102</td>
<td class="org-left">Bob</td>
</tr>


<tr>
<td class="org-right">104</td>
<td class="org-left">Carol</td>
</tr>
</tbody>
</table>

The result of the SQL query will be:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">order<sub>id</sub></th>
<th scope="col" class="org-left">customer<sub>name</sub></th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Alice</td>
</tr>


<tr>
<td class="org-right">2</td>
<td class="org-left">Bob</td>
</tr>
</tbody>
</table>

As you can see, only the rows with matching \`customer<sub>id</sub>\` values (1
and 2) are included in the result, and it combines the relevant data
from both tables.


### LEFT JOIN (or LEFT OUTER JOIN)

-   A LEFT JOIN returns all rows from the left table and the matched rows

from the right table.

-   If there's no match in the right table, NULL

values are filled in for the columns from the right table.

Example:

    SELECT customers.customer_name, orders.order_id
    FROM customers
    LEFT JOIN orders ON customers.customer_id = orders.customer_id;


### RIGHT JOIN (or RIGHT OUTER JOIN)

-   A RIGHT JOIN is similar to a LEFT JOIN, but it returns all rows

from the right table and the matched rows from the left table.

-   If there's no match in the left table, NULL values are filled in for

the columns from the left table.

Example:

    SELECT customers.customer_name, orders.order_id
    FROM customers
    RIGHT JOIN orders ON customers.customer_id = orders.customer_id;


### LEFT or RIGHT

In SQL joins, particularly when discussing LEFT JOIN and RIGHT JOIN,
the terms "left" and "right" refer to the order of the tables being
joined and the direction of the inclusion of rows in the result
set. These terms help describe which table's data is preserved fully
and which table's data may have missing values (NULLs) in the result
set. Let's clarify the differences:

1.  LEFT JOIN (or LEFT OUTER JOIN):
    -   The "left" table is the table listed on the left side of the JOIN
        clause.
    -   All rows from the left table are included in the result set,
        regardless of whether there is a match in the right table.
    -   If there is a match in the right table, the corresponding data is
        included in the result set.
    -   If there is no match in the right table, NULL values are used for
        the columns from the right table.

2.  RIGHT JOIN (or RIGHT OUTER JOIN):
    -   The "right" table is the table listed on the right side of the
        JOIN clause.
    -   All rows from the right table are included in the result set,
        regardless of whether there is a match in the left table.
    -   If there is a match in the left table, the corresponding data is
        included in the result set.
    -   If there is no match in the left table, NULL values are used for
        the columns from the left table.

In summary, the primary difference between LEFT JOIN and RIGHT JOIN is
the direction in which they include rows from the tables involved in
the join. LEFT JOIN keeps all rows from the left table, while RIGHT
JOIN keeps all rows from the right table. The choice of whether to use
LEFT JOIN or RIGHT JOIN depends on your specific data and query
requirements. Most often, LEFT JOIN is used because it retains all
records from the "left" or main table and includes matching data from
the "right" or related table when available.
