README.org
*** CROSS join
A CROSS JOIN, also known as a Cartesian join, is a type of join operation in SQL where every row from one table is combined with every row from another table, resulting in a Cartesian product of the two tables. In other words, it creates all possible combinations of rows from the two tables, without any specific condition or criteria for matching rows. As a result, the size of the result set can grow rapidly, especially if the tables being joined are large.

Here's the basic syntax for a CROSS JOIN:

#+begin_src sql
SELECT *
FROM table1
CROSS JOIN table2;
#+end_src

In this syntax:

- `table1` and `table2` are the names of the two tables you want to combine.
- `*` is used to select all columns from both tables in the Cartesian product.

Here's an example to illustrate a CROSS JOIN:

Assume you have two tables:

*table1 (colors):*

| color |
|-------|
| Red   |
| Green |
| Blue  |

*table2 (sizes):*

| size   |
|--------|
| Small  |
| Medium |
| Large  |

If you perform a CROSS JOIN between these two tables:

#+begin_src sql
SELECT *
FROM colors
CROSS JOIN sizes;
#+end_src

The result will be the Cartesian product of all color and size combinations:

| color  | size   |
|--------+--------|
| Red    | Small  |
| Red    | Medium |
| Red    | Large  |
| Green  | Small  |
| Green  | Medium |
| Green  | Large  |
| Blue   | Small  |
| Blue   | Medium |
| Blue   | Large  |

As you can see, every color is combined with every size, resulting in
a total of 9 rows in the result set.

CROSS JOINs are relatively rare in practice because they tend to
generate large result sets and can be computationally expensive. They
are typically used in specific scenarios where you need to generate
all possible combinations, such as when creating test data or
performing certain types of mathematical calculations. In most cases,
other types of joins (e.g., INNER JOIN, LEFT JOIN) with appropriate
conditions are more commonly used to retrieve meaningful data from
related tables.
*** FULL UTER JOIN
Here's a brief overview of the key characteristics of a FULL OUTER
JOIN:

    Returns All Rows: Unlike INNER JOIN, which only returns matching
    rows, a FULL OUTER JOIN returns all rows from both the left and
    right tables.

    NULL Values: When there is no match for a row in one of the
    tables, the columns from that table will contain NULL values in
    the result set.

    Combines Data: A FULL OUTER JOIN combines data from two tables
    based on a specified join condition, creating a unified result
    set.

    Useful for Comparisons: FULL OUTER JOINs are often used when you
    need to compare data from two tables comprehensively, such as
    identifying records that exist in one table but not in the other
    or finding matching records while also including non-matching
    ones.

Here's the basic syntax for a FULL OUTER JOIN:
#+begin_src sql
SELECT *
FROM table1
FULL OUTER JOIN table2 ON table1.column_name = table2.column_name;
#+end_src
*** multiple columns
In this scenario, we have three tables: `orders`, `customers`,
and `products`. We want to retrieve a list of orders that includes the
customer name and the product name for each order.

Assuming the following table structures:

**orders:**

| order_id | customer_id | product_id |
|----------+-------------+------------|
|        1 |         101 |        201 |
|        2 |         102 |        202 |
|        3 |         103 |        201 |
|        4 |         104 |        203 |

*customers:*

| customer_id | customer_name |
|-------------+---------------|
|         101 | Alice         |
|         102 | Bob           |
|         103 | Carol         |
|         104 | David         |

*products:*

| product_id | product_name |
|------------+--------------|
|        201 | Laptop       |
|        202 | Smartphone   |
|        203 | Tablet       |

We can use an INNER JOIN to combine these tables to get the desired result:

#+begin_src sql
SELECT orders.order_id, customers.customer_name, products.product_name
FROM (orders
INNER JOIN customers ON orders.customer_id = customers.customer_id)
INNER JOIN products ON orders.product_id = products.product_id;
#+end_src

In this query:

1. The first INNER JOIN combines the `orders` and `customers` tables
   based on the `customer_id` column, linking each order to its
   respective customer.

2. The second INNER JOIN combines the result of the first join (which
   includes order and customer information) with the `products` table
   based on the `product_id` column, linking each order to its
   corresponding product.

The result of this query will be a list of orders with the customer
name and the product name for each order:

| order_id | customer_name | product_name  |
|----------+---------------+---------------|
|        1 | Alice         | Laptop        |
|        2 | Bob           | Smartphone    |
|        3 | Carol         | Laptop        |
|        4 | David         | Tablet        |

This query demonstrates how you can use INNER JOINs to combine data
from three tables to create a comprehensive result set that includes
information from all three tables based on specified join conditions.
*** using alias
#+begin_src sql
SELECT c.customer_name, o.order_date
FROM customers c
INNER JOIN orders o ON c.customer_id = o.customer_id
WHERE c.city = 'New York';

#+end_src

#+begin_src sql
SELECT o.order_id, c.customer_name
FROM orders AS o
INNER JOIN customers AS c ON o.customer_id = c.customer_id;

#+end_src
