README.md


### self-join

A self-join is a specific type of join operation in SQL where a table
is joined with itself. In other words, it's a way to combine rows from
the same table based on a related column. Self-joins are commonly used
when you have hierarchical or recursive data stored within a single
table, and you need to retrieve relationships or data from different
rows within the same table.

Here's how a self-join works:

1.  **Table with Self-Reference**: In a self-join scenario, the table
    must contain a column or columns that establish a relationship
    between rows within the same table. This typically involves having
    a foreign key column that references the primary key column of the
    same table. This creates a self-referencing relationship.

2.  **Join Condition**: You specify a join condition that defines how the
    rows in the table should be matched with other rows in the same
    table. This condition typically involves comparing the values in
    the self-referencing columns.

3.  **Result Set**: The result of the self-join is a new table that
    combines data from the original table based on the specified join
    condition.

Here's a simple example to illustrate a self-join. Suppose you have an
"employees" table with the following structure:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">employee<sub>id</sub></th>
<th scope="col" class="org-left">employee<sub>name</sub></th>
<th scope="col" class="org-right">manager<sub>id</sub></th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Alice</td>
<td class="org-right">NULL</td>
</tr>


<tr>
<td class="org-right">2</td>
<td class="org-left">Bob</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">3</td>
<td class="org-left">Carol</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">4</td>
<td class="org-left">David</td>
<td class="org-right">2</td>
</tr>


<tr>
<td class="org-right">5</td>
<td class="org-left">Eve</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>

In this table:

-   \`employee<sub>id</sub>\` is the primary key.
-   \`employee<sub>name</sub>\` stores the names of employees.
-   \`manager<sub>id</sub>\` is a foreign key that references the \`employee<sub>id</sub>\` of the employee's manager. It establishes a self-referencing relationship.

You can use a self-join to retrieve the names of employees along with the names of their managers:

    SELECT e.employee_name AS employee, m.employee_name AS manager
    FROM employees e
    LEFT JOIN employees m ON e.manager_id = m.employee_id;

In this query:

-   \`e\` is an alias for the "employees" table, representing employees.
-   \`m\` is an alias for the same "employees" table, representing managers.
-   The self-join condition \`e.manager<sub>id</sub> = m.employee<sub>id</sub>\` connects each
    employee with their respective manager.

The result of the self-join will be:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">employee</th>
<th scope="col" class="org-left">manager</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Alice</td>
<td class="org-left">NULL</td>
</tr>


<tr>
<td class="org-left">Bob</td>
<td class="org-left">Alice</td>
</tr>


<tr>
<td class="org-left">Carol</td>
<td class="org-left">Alice</td>
</tr>


<tr>
<td class="org-left">David</td>
<td class="org-left">Bob</td>
</tr>


<tr>
<td class="org-left">Eve</td>
<td class="org-left">Bob</td>
</tr>
</tbody>
</table>

As you can see, the self-join allows you to retrieve the names of
employees along with the names of their respective managers from the
same table, creating a hierarchical relationship. Self-joins are
particularly useful in scenarios involving organizational hierarchies,
bill-of-materials structures, and other situations where data has a
parent-child or recursive relationship within a single table.


### UNIONs

In SQL, the UNION operator is used to combine the result sets of two
or more SELECT statements into a single result set. It allows you to
merge rows from different tables or even from the same table based on
common columns or data types. The UNION operator removes duplicate
rows by default, but you can also use UNION ALL if you want to include
duplicate rows in the result.

-   **Column Compatibility**: The SELECT statements within a UNION must have
    the same number of columns, and the corresponding columns in each
    SELECT statement must have compatible data types. The column names
    from the first SELECT statement are used as the column names in the
    result.

-   **Duplicate Removal**: By default, UNION removes duplicate rows from the
    combined result set. If you want to keep duplicate rows, you can use
    UNION ALL instead.

    SELECT column1, column2, ...
    FROM table1
    UNION
    SELECT column1, column2, ...
    FROM table2;


<a id="orgd4c578f"></a>

## JOIN vs Subquery

In JOIN you can call different columns from different tables but in
subquery, the table that is called inside the subquery is not
accessible outside the subquery. 


<a id="orgf7a4981"></a>

# WEEK #4


<a id="org06b89f5"></a>

## Working with Text Strings

-   Concatenating
    
        select col1 || '(' || col2 || ')' from tab1;
-   Trimming
    
        select trim('      you the best     ') as trim_str;

Removes trailing spaces from both sides. There is RTRIM and LTRIM also.

-   Substring
    
        select substr(col1, num1, num2) from tab1;

num1 is the beginning of the trimming and num2 is the length of the
trim. num1 starts with 1.

-   Case
    
        select upper(col1) from tab1;
        select lower(col1) from tab1;
        select ucase(col1) from tab1;


<a id="org9c0db81"></a>

## Date and Time Strings


### strfmt

The \`strftime\` function in SQLite is used to format date and time
values as strings. It allows you to specify a format string with
various modifiers to control how the date and time should be
displayed. The basic syntax of the \`strftime\` function is as follows:

    strftime(format, timestamp)

-   \`format\`: This is a required argument and specifies the format you
    want the date and time to be displayed in. It is a string containing
    format codes and optional text.

-   \`timestamp\`: This is the timestamp or date and time value that you
    want to format.

Here are some common format codes and modifiers you can use with the
\`strftime\` function in SQLite:

**Date Format Codes**:

-   \`%Y\`: Four-digit year (e.g., 2023).
-   \`%m\`: Month as a zero-padded decimal number (01-12).
-   \`%d\`: Day of the month as a zero-padded decimal number (01-31).
-   \`%W\`: Week number of the year as a decimal number (00-53).

**Time Format Codes**:

-   \`%H\`: Hour (00-23).
-   \`%M\`: Minute (00-59).
-   \`%S\`: Second (00-59).

**Other Format Codes**:

-   \`%a\`: Abbreviated weekday name (Sun, Mon, Tue, etc.).
-   \`%A\`: Full weekday name (Sunday, Monday, Tuesday, etc.).
-   \`%b\`: Abbreviated month name (Jan, Feb, Mar, etc.).
-   \`%B\`: Full month name (January, February, March, etc.).
-   \`%c\`: Preferred date and time representation (usually the same as \`%a %b %d %H:%M:%S %Y\`).
-   \`%p\`: AM or PM designation (AM/PM).

**Modifiers**:

-   \`-\`: A hyphen \`-\` before a modifier (e.g., \`%-d\`) removes leading zeros.
-   \`\_\`: An underscore \`\_\` before a modifier (e.g., \`\_%d\`) pads with spaces instead of zeros.
-   \`0\`: A zero \`0\` before a modifier (e.g., \`%0d\`) pads with zeros (default behavior).

Examples of using the \`strftime\` function with modifiers and format codes:

    -- Format a timestamp as "YYYY-MM-DD HH:MM:SS"
    SELECT strftime('%Y-%m-%d %H:%M:%S', '2023-09-06 15:30:00');

    -- Format a timestamp without leading zeros in the day and month
    SELECT strftime('%Y-%-m-%-d %H:%M:%S', '2023-09-06 15:30:00');

    -- Format a timestamp with abbreviated month and day names
    SELECT strftime('%A, %B %d, %Y', '2023-09-06 15:30:00');

    -- Format a timestamp as "hh:MM AM/PM"
    SELECT strftime('%I:%M %p', '2023-09-06 15:30:00');

\`\`\`


### Now

To retrieve the current date:

    select date('now');
