README.md


<a id="orgcddc9e0"></a>

## Case Statements

In SQLite, the CASE statement is a conditional expression that allows
you to perform conditional logic within SQL queries. It's useful for
making decisions and returning different values or performing
different actions based on specific conditions. The CASE statement can
be used in both SELECT statements and UPDATE statements.

The basic syntax of the CASE statement in SQLite is as follows:

    CASE
        WHEN condition1 THEN result1
        WHEN condition2 THEN result2
        ...
        ELSE else_result
    END

Example:

    SELECT
        name,
        CASE
    	WHEN age >= 18 THEN 'Adult'
    	ELSE 'Minor'
        END AS age_group
    FROM people;

In this example, we use a CASE statement to categorize people as
either 'Adult' or 'Minor' based on their age.


<a id="orge04b208"></a>

## Create View

In SQLite, a view is a virtual table created from the result of a
SELECT query. Unlike physical tables, views do not store data
themselves; instead, they provide a way to access and manipulate data
from one or more underlying tables or other views. Views are often
used to simplify complex queries, encapsulate logic, and provide a
consistent interface to users or applications.

To create a view in SQLite, you use the CREATE VIEW statement. Here's
the basic syntax:

    CREATE VIEW view_name AS
    SELECT columns
    FROM tables
    WHERE conditions;

Once a view is created, you can query it just like a regular table
using the SELECT statement:

    SELECT * FROM top_customers;


### drop the view

    drop view my_view;


### ETL

ETL stands for Extract, Transform, Load, and it is a concept related
to data integration and database management, often associated with SQL
databases. ETL is a process used to collect, clean, and move data from
various sources into a destination database or data warehouse for
analysis, reporting, or other purposes. Each phase of the ETL process
serves a specific purpose.


<a id="orgc771516"></a>

## Data Governance and Profiling

Data profiling in SQL is a process used to analyze and understand the
characteristics, structure, and quality of a dataset or a database. It
involves examining the data to gain insights into its content,
distribution, completeness, accuracy, and potential issues. Data
profiling is an essential step in data analysis, data cleansing, and
data integration processes. Here are the key concepts related to data
profiling in SQL:

-   Data Exploration: Data profiling begins with exploring the data to
    get a high-level understanding of its contents. Analysts or data
    professionals use SQL queries to retrieve sample data, count
    records, and examine the data types of columns.

-   Column Profiling: Data profiling often involves profiling individual
    columns within a dataset or database table. This includes:
    Determining data types (e.g., integer, string, date). Calculating
    statistics such as minimum, maximum, mean, median, and standard
    deviation. Identifying unique values and their
    frequencies. Detecting missing values and calculating the percentage
    of missing data. Checking for data patterns, formats, and
    distributions.


<a id="orgee94fa6"></a>

## links

SQL puzzles

[SQL Authority: SQL Puzzles](https://blog.sqlauthority.com/category/sql-puzzle/)

Recommended by many recruiters to practice SQL for a data science interview.

[SQLZOO](https://sqlzoo.net/)

